# Задание:
# Сделай программу «Читач файлу»

# Функционал:

# Меню:

# 1 — Записати текст
# 2 — Показати вміст файлу
# 3 — Вийти


# Текст добавляется в файл data.txt (не перезаписывается)

# При чтении:

# выводи файл построчно

# Обработай ошибку, если файл не найден (try/except)

# Подсказки:

# режим "a"

# for line in file

# FileNotFoundError

#      Читач файлу       #
# while True:

#     print("1 = Записати текст")
#     print("2 = Показати вміст файлу")
#     print("3 = Вийти")


#     Way = input("обери дiю (1/2/3): ")
#     if Way == "1":
#         try:
#             file = open("lesson.txt", "a")
#             text = str(input("Введи текст: "))
#             file.write(text + "\n") 
#             file.close()
#         except:
#             print("Помилка")
#     elif Way == "2":
#         try:
#             file = open("lesson.txt", "r")
#             content = file.read()
#             print(f"Вмiст: {content}")
#             file.close()
#         except FileNotFoundError:
#             print("файл не знайдено")
#     elif Way == "3":
#         print("👋 До побачення!")
#         break 
#     else:
#         print("❌ Невірний вибір. Спробуй ще раз.")
#-----------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------
# Задание:
# Сделай міні-банківську систему з файлами

# Требования:

# Баланс хранится в файле balance.txt

# При запуске:

# если файла нет → баланс = 0

# Меню:

# 1 — Додати гроші
# 2 — Зняти гроші
# 3 — Показати баланс
# 4 — Вийти


# Используй функции

# Обработай ошибки:

# ввод не числа

# снятие больше баланса

# Обязательно использовать:

# try / except

# with open

# функции

# int()
